
// 第二十四章  最佳实践

// 24.1  可维护性
//     24.1.1  什么是可维护的代码
                // 可理解性：其他人可以接受代码并理解他的意图和一般途径，而无需原开发人员的完整解释。
                // 直观性：代码中的东西一看就能明白，不管其操作过程是多么复杂。
                // 可适应新：代码以一种数据上的变化不要求完全重写的方法撰写。
                // 可扩展性：在代码架构上衣考虑到未来允许对核心功能进行扩展。
                // 可调试性：当有地方出错，代码可以给予你足够的信息来尽可能直接地确定问题所在。
//     24.1.2  代码约定
                //见网易前端规范

//     24.1.3  松散耦合

                // 1.解耦HTML/JavaScript
                // 2.解耦CSS/JavaScript
//     24.1.4  编程实践
// 24.2  性能
//     24.2.1  注意作用域
//     24.2.2  选择正确的方法
//     24.2.3  最小化语句数
//     24.2.4  优化DOM交互
// 24.3  部署
//     24.3.1  构建过程
//     24.3.2  验证
//     24.3.3  压缩
// 24.4  小结